experiments/results/thesis/DPFS-RVFS-Ceph-T1-polling/fio_randwrite_16k_1_1.out
"randwrite_16k_1_1": (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=io_uring, iodepth=1
fio-3.28
Starting 1 thread

"randwrite_16k_1_1": (groupid=0, jobs=1): err= 0: pid=123479: Mon Aug  7 17:17:16 2023
  write: IOPS=1114, BW=17.4MiB/s (18.3MB/s)(1045MiB/60001msec); 0 zone resets
    slat (nsec): min=5433, max=23792, avg=6080.49, stdev=636.44
    clat (usec): min=665, max=10983, avg=889.74, stdev=203.73
     lat (usec): min=671, max=10990, avg=896.01, stdev=203.73
    clat percentiles (usec):
     |  1.00th=[  734],  5.00th=[  766], 10.00th=[  783], 20.00th=[  799],
     | 30.00th=[  824], 40.00th=[  840], 50.00th=[  857], 60.00th=[  873],
     | 70.00th=[  898], 80.00th=[  930], 90.00th=[  996], 95.00th=[ 1074],
     | 99.00th=[ 2073], 99.50th=[ 2343], 99.90th=[ 2769], 99.95th=[ 3392],
     | 99.99th=[ 5932]
   bw (  KiB/s): min=17248, max=18368, per=100.00%, avg=17836.64, stdev=256.26, samples=120
   iops        : min= 1078, max= 1148, avg=1114.78, stdev=16.02, samples=120
  lat (usec)   : 750=2.25%, 1000=88.11%
  lat (msec)   : 2=8.54%, 4=1.08%, 10=0.03%, 20=0.01%
  cpu          : usr=0.32%, sys=1.08%, ctx=66975, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,66884,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=17.4MiB/s (18.3MB/s), 17.4MiB/s-17.4MiB/s (18.3MB/s-18.3MB/s), io=1045MiB (1096MB), run=60001-60001msec